Revit 2027 API
BuiltInFailures.PointFailures.HostMeasurementError Property
 Invalid host curve measurement type or value or justification
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostMeasurementError { get; }
Public Shared ReadOnly Property HostMeasurementError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostMeasurementError {
	FailureDefinitionId^ get ();
}
static member HostMeasurementError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PointFailures Class
Autodesk.Revit.DB Namespace